<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>






  


  
  
  
  
  
  
  
  
  
  
  
  <title>Untitled Document</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>


<body>







<h2>Ontologias </h2>

<p>Uma ontologia &eacute; uma rela&ccedil;&atilde;o
de conceitos e rela&ccedil;&otilde;es, assim como os mapas
conceituais, s&oacute; que as rela&ccedil;&otilde;es
cont&ecirc;m v&aacute;rias frases de
liga&ccedil;&atilde;o. S&atilde;o usadas, no CMTool, pelos
professores, para que eles definam conceitos e frases de
liga&ccedil;&atilde;o e, a partir da&iacute;, as
proposi&ccedil;&otilde;es que eles acham mais corretas. Os
mapas conceituais que seus alunos far&atilde;o conter&atilde;o
os conceitos definidos. As proposi&ccedil;&otilde;es dos mapas
ser&atilde;o avaliadas comparando-as com as
rela&ccedil;&otilde;es contidas na ontologia, por meio de um
algoritmo gen&eacute;tico, o GAADT-CM, contido no CMTool. </p>







<p>Aqui ser&atilde;o
descritos os passos para serem feitas ontologias. </p>







<p>&nbsp;</p>







<p>&nbsp;</p>







<p>&nbsp;</p>







<h3><a name="1"></a>Criando a ontologia </h3>







<p>Ao abrir o On_Tool, aparecer&aacute; a caixa de
di&aacute;logo &ldquo;Bem-vindo ao On_Tool&rdquo;. Na
lista de sele&ccedil;&atilde;o, selecione a
op&ccedil;&atilde;o &ldquo;Criar uma ontologia&rdquo;, clicando OK em seguida. </p>







<p align="center"><img style="width: 290px; height: 254px;" alt="" src="imagens/001.jpg"><br>

</p>







<p>Se quiser criar uma ontologia com o On_Tool j&aacute; em execu&ccedil;&atilde;o,
voc&ecirc; pode seguir uma das 3 alternativas: </p>







<ul>







  <li>
    
    
    
    
    
    
    <p>Na barra de menus, clique em
&ldquo;Arquivo&rdquo;, e &ldquo;Novo&rdquo;, em
seguida; </p>







  </li>







  <li>
    
    
    
    
    
    
    <p>Na barra de tarefas, clique no bot&atilde;o <img src="imagens/002.gif" height="24" width="24">;
    </p>







  </li>







  <li>
    
    
    
    
    
    
    <p>No teclado, segure a tecla Ctrl e aperte N. </p>







  </li>







</ul>







<p>Se voc&ecirc; tiver feito alguma
modifica&ccedil;&atilde;o na ontologia em
execu&ccedil;&atilde;o antes de voc&ecirc; fazer uma das
opera&ccedil;&otilde;es acima, surgir&aacute; o
di&aacute;logo de &ldquo;Salvar&rdquo;. Saiba mais detalhes
clicando <a href="salvar_abrir.html">aqui</a>. </p>







<p>&nbsp;</p>







<p>&nbsp;</p>







<p>&nbsp;</p>







<h3><a name="2"></a>Preenchendo a ontologia </h3>







<p>A primeira coisa a fazer &eacute; criar um conceito. Para
isso, basta clicar duas vezes em um espa&ccedil;o em branco da
&aacute;rea de desenho. Surgir&aacute; o di&aacute;logo de
cria&ccedil;&atilde;o de elementos. </p>







<p align="center"><img style="width: 270px; height: 156px;" alt="" src="imagens/004.jpg"><br>
</p>







<p>Nesta caixa de di&aacute;logo, note que
aparecer&atilde;o 2 tipos de elementos a serem criados: </p>







<ul>







  <li>
    
    
    
    
    
    
    <p><strong>Conceito: </strong>Nas proposi&ccedil;&otilde;es, podem receber e
enviar arcos. Possuem setas flutuantes, que s&atilde;o usadas para
criar as proposi&ccedil;&otilde;es. </p>







  </li>







  





  <li>
    
    
    
    
    
    
    <p><strong>Legendas: </strong>Servem apenas para
fazer anota&ccedil;&otilde;es na ontologia, que
n&atilde;o fazem parte da ontologia, mas que podem
explic&aacute;-la. </p>







  </li>







</ul>

<p>Pelo explicado acima, &eacute; recomendado que
voc&ecirc; escolha primeiramente desenhar um conceito. Escolha o
tipo de elemento e clique em OK. </p>








<p>Agora voc&ecirc; ir&aacute; querer editar os elementos
de uma ontologia. Para isso, basta usar o mouse,
clicando duas vezes em cima do determinado elemento.</p>








<p>Ao clicar duas vezes em cima de um conceito ou
de uma legenda, aparecer&aacute; uma caixa de di&aacute;logo
com uma &aacute;rea de texto como a abaixo.</p>








<p align="center"><img src="imagens/011.jpg" height="190" width="268"></p>








<p>Voc&ecirc; pode, ent&atilde;o, digitar o novo
r&oacute;tulo e clicar em OK.</p>

<p align="left">Para criar relacionamentos, voc&ecirc;
deve posicionar o cursor do mouse sobre um conceito.
Surgir&atilde;o duas setas flutuantes. </p>







<p align="center"><img src="imagens/005.gif" height="31" width="83"></p>
<p>Posicione o mouse sobre uma das setas. Clique e segure o
bot&atilde;o do mouse. Arrastando a seta, voc&ecirc;
ver&aacute; uma linha surgir, para que lhe ajude a desenhar. </p>







<p align="center"><img src="imagens/006.gif" height="121" width="121"></p>







<p>Solte o bot&atilde;o no lugar desejado. Ser&aacute; criada uma
proposi&ccedil;&atilde;o, composta de mais um conceito,
uma rela&ccedil;&atilde;o bin&aacute;ria e arcos ligando os
elementos, como voc&ecirc; pode ver na figura abaixo. </p>







<p align="center"><img src="imagens/007.gif" height="239" width="90"></p>
<p>A partir de agora, voc&ecirc; pode ir criando suas ontologias,
com duplos cliques e arraste de setas flutuantes, vindas de conceitos e
de rela&ccedil;&otilde;es bin&aacute;rias. Uma boa dica &eacute;
criar v&aacute;rios conceitos e, depois, fazer as
proposi&ccedil;&otilde;es.</p>


<p>&nbsp;</p>







<p>&nbsp;</p>







<p>&nbsp;</p>







<h3><a name="3"></a>Editando rela&ccedil;&otilde;es bin&aacute;rias </h3>







<p>Para editar uma rela&ccedil;&atilde;o bin&aacute;ria, clique duas vezes com o mouse em cima
dela. Surgir&aacute; uma caixa de di&aacute;logo com uma
&aacute;rvore. Essa &aacute;rvore cont&eacute;m a taxonomia
de frases de liga&ccedil;&atilde;o, de acordo com o explicado
no in&iacute;cio dessa se&ccedil;&atilde;o. </p>







<p align="center"><img style="width: 449px; height: 457px;" alt="" src="imagens/017.jpg"><br>
</p>







<p>Acima, voc&ecirc; v&ecirc; que o di&aacute;logo
cont&eacute;m 3 &aacute;reas: </p>







<ul>







  <li>
    
    
    
    
    
    
    <p><strong>&Aacute;rvore taxon&ocirc;mica </strong>,
onde voc&ecirc; seleciona um ramo. Cada ramo cont&eacute;m
frases de liga&ccedil;&atilde;o. </p>







  </li>







  <li>
    
    
    
    
    
    
    <p><strong>Frases de liga&ccedil;&atilde;o</strong>,
onde voc&ecirc; seleciona as frases desejadas. </p>







  </li>







  <li>
    
    
    
    
    
    
    <p><strong>Descri&ccedil;&atilde;o do
n&oacute; da &aacute;rvore taxon&ocirc;mica</strong>.
A descri&ccedil;&atilde;o muda de acordo com o n&oacute;
selecionado. </p>







  </li>







</ul>







<p>Busque um supertipo na &aacute;rvore. Segurando a tecla Ctrl, clique
em cima das frases de liga&ccedil;&atilde;o desejadas. Quando acabar,
clique em OK. </p>







</body>
</html>
