<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>



  
  
  <title>Untitled Document</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>


<body>


<h2>Prefer&ecirc;ncias </h2>


<p>Voc&ecirc; pode querer fazer com que os elementos de suas ontologias j&aacute; tenham uma cor pr&eacute;-definida, ou um tipo de
letra pr&eacute;-definida. Para isso foi feito o di&aacute;logo de
prefer&ecirc;ncias, onde voc&ecirc; pode fazer tais
opera&ccedil;&otilde;es. </p>


<p>H&aacute; duas maneiras de abrir o di&aacute;logo de prefer&ecirc;ncias: </p>


<ul>


  <li>
    
    
    <p>Na barra de menus, clique em Editar e, em seguida, &ldquo;Prefer&ecirc;ncias&rdquo;; </p>


  </li>


  <li>
    
    
    <p>No teclado, segure a tecla Alt e tecle P. </p>


  </li>


</ul>


<p>O di&aacute;logo de prefer&ecirc;ncias &eacute; o abaixo. Nele,
voc&ecirc; ver&aacute; 6 op&ccedil;&otilde;es. Basta clicar em
&ldquo;Alterar&rdquo;, do lado de cada op&ccedil;&atilde;o. Exceto,
&eacute; claro, na segunda op&ccedil;&atilde;o, onde voc&ecirc;
seleciona em uma lista a op&ccedil;&atilde;o desejada. </p>


<p align="center"><img src="imagens/025.jpg" height="289" width="316"></p>


<p align="left">As op&ccedil;&otilde;es s&atilde;o: </p>


<ul>


  <li>
    
    
    <p align="left"><strong>Cor padr&atilde;o das linhas: </strong>define a cor padr&atilde;o que as linhas (arcos) ter&atilde;o; </p>


  </li>


  <li>
    
    
    <p align="left"><strong>Estilo padr&atilde;o de linhas: </strong>define o estilo padr&atilde;o que as linhas (arcos) ter&atilde;o: reta, ortogonal ou curva;</p>


  </li>


  <li>
    
    
    <p align="left"><strong>Cor padr&atilde;o das bordas: </strong>define a cor padr&atilde;o da borda de conceitos e exemplos; </p>


  </li>


  <li>
    
    
    <p align="left"><strong>Cor padr&atilde;o de preenchimento: </strong>define a cor padr&atilde;o do preenchimento de conceitos e exemplos; </p>


  </li>


  <li>
    
    
    <p align="left"><strong>Cor padr&atilde;o de letras: </strong>define a cor padr&atilde;o das letras dos elementos; </p>


  </li>


  <li>
    
    
    <p align="left"><strong>Fonte padr&atilde;o: </strong>define as fontes (tipos de letra) padr&atilde;o dos elementos.</p>


  </li>


</ul>


<p align="left">Ap&oacute;s selecionar as op&ccedil;&otilde;es
desejadas, clique em OK. A partir disso, todos os padr&otilde;es que
voc&ecirc; definiu estar&atilde;o funcionando. </p>


</body>
</html>
