<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>


  


  
  
  
  <title>Untitled Document</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>


<body>



<h2>Sele&ccedil;&atilde;o e &aacute;rea de
transfer&ecirc;ncia </h2>



<p>Nessa se&ccedil;&atilde;o, voc&ecirc;
saber&aacute; como selecionar os elementos da &aacute;rea de
desenho do On_Tool. Saber&aacute; tamb&eacute;m como duplicar
tais elementos, o que facilitar&aacute; muito a sua vida.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h3><a name="1"></a>Selecionando elementos</h3>



<p>H&aacute; 4 maneiras de selecionar elementos da
&aacute;rea de desenho:</p>



<ol>



  <li>
    
    
    <p><span style="font-weight: bold;">Sele&ccedil;&atilde;o simples: </span>Clique uma vez com o
mouse em cima de um elemento. Assim, voc&ecirc;
selecionar&aacute; apenas um elemento por vez.</p>


  </li>



  <li>
    
    
    <p><span style="font-weight: bold;">Sele&ccedil;&atilde;o m&uacute;ltipla
controlada: </span>Segure, no teclado, a tecla Ctrl. Com ela pressionada,
clique uma vez em v&aacute;rios elementos. Essa t&eacute;cnica
&eacute; &uacute;til para selecionar poucos elementos, ou
elementos muito distantes.</p>


  </li>



  <li>
    
    
    <p><span style="font-weight: bold;">Sele&ccedil;&atilde;o m&uacute;ltipla
r&aacute;pida: </span>Clique e segure o bot&atilde;o do mouse sobre
uma &aacute;rea em branco, ou seja, sem nenhum elemento. Com o
bot&atilde;o pressionado, arraste o mouse. Voc&ecirc;
notar&aacute; que surgir&aacute; um quadrado. Continue
arrastando o mouse fazendo com que esse quadrado cerque os elementos
que voc&ecirc; deseja selecionar, como ilustrado na figura abaixo.<br>



    <br>



Quando o quadrado cercar os elementos desejados, solte o
bot&atilde;o. Essa t&eacute;cnica &eacute; mais
r&aacute;pida que a anterior, selecionando muitos elementos.</p>


  </li>



  <li> Selecionar tudo: Na barra de menus, clique em Editar e
Selecionar tudo, em seguida. Ou, no teclado, segure a tecla Ctrl e
tecle A. Voc&ecirc; selecionar&aacute; todos os elementos
existentes na &aacute;rea de desenho.</li>
</ol>



<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h3><a name="2"></a>Recortando e colando</h3>



<p>Essa opera&ccedil;&atilde;o faz com que voc&ecirc;
exclua os elementos selecionados da &aacute;rea de desenho, para
depois col&aacute;-los.</p>




<ol>



  <li>
    
    
    <p>Selecione um ou v&aacute;rios elementos, usando uma das 4 t&eacute;cnicas explicadas anteriormente.<br>



    </p>



  </li>



  <li>
    
    
    <p>Na barra de menus, v&aacute; em Editar e clique em Recortar. Ou,
no teclado, segure a tecla Ctrl e tecle X. Voc&ecirc; excluir&aacute;
os elementos da &aacute;rea de desenho e eles ficar&atilde;o
armazenados na &aacute;rea de transfer&ecirc;ncia do On_Tool.</p>



  </li>



  <li>
    
    
    <p>Para colar os elementos da &aacute;rea de transfer&ecirc;ncia,
v&aacute; na barra de menus, clique em Editar e&nbsp;em Colar. Ou, no
teclado, segure a tecla Ctrl e tecle V. Voc&ecirc; pode colar
v&aacute;rias vezes os elementos da &aacute;rea de transfer&ecirc;ncia.</p>


  </li>




</ol>


<p>Obs.: cada vez que voc&ecirc; recorta ou copia elementos, a
&aacute;rea de transfer&ecirc;ncia &eacute; esvaziada. Ou seja, os
elementos l&aacute; existentes ser&atilde;o perdidos, e dar&atilde;o
lugar aos novos.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h3><a name="3"></a>Copiando<br>


</h3>


<p>Essa opera&ccedil;&atilde;o faz com que voc&ecirc;
cole elementos da &aacute;rea de transfer&ecirc;ncia do On_Tool na &aacute;rea de desenho, sem excluir os elementos originais.</p>




<ol>


  <li>
    
    
    <p>Selecione um ou v&aacute;rios elementos, usando uma das 4 t&eacute;cnicas explicadas anteriormente.<br>



    </p>



  </li>


  <li>
    
    
    <p>Na barra de menus, v&aacute; em Editar e clique em Copiar. Ou, no
teclado, segure a tecla Ctrl e tecle C. Voc&ecirc; enviar&aacute; uma c&oacute;pia dos elementos da
&aacute;rea de desenho para a &aacute;rea de transfer&ecirc;ncia do On_Tool.</p>



  </li>


  <li>
    
    
    <p>Para colar os elementos da &aacute;rea de transfer&ecirc;ncia, v&aacute; na barra de
menus, clique em Editar e&nbsp;em Colar. Ou, no teclado, segure a tecla Ctrl
e tecle V. Voc&ecirc; pode colar v&aacute;rias vezes os elementos da &aacute;rea de
transfer&ecirc;ncia.</p>


  </li>


</ol>


Obs.: cada vez que voc&ecirc; recorta ou copia elementos, a &aacute;rea de
transfer&ecirc;ncia &eacute; esvaziada. Ou seja, os elementos l&aacute; existentes ser&atilde;o
perdidos, e dar&atilde;o lugar aos novos.
</body>
</html>
