<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>



  
  
  <title>Untitled Document</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>


<body>


<h2>Op&ccedil;&otilde;es de formata&ccedil;&atilde;o </h2>


<p>Voc&ecirc; pode formatar os elementos da sua ontologia,
escolhendo cores e tipos de letras. Voc&ecirc; acessa todas as
op&ccedil;&otilde;es de formata&ccedil;&atilde;o no menu Formatar, na
barra de menus. </p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<p>&nbsp; </p>


<h3><a name="1"></a>Formatando cor de letra </h3>


<p>Essa opera&ccedil;&atilde;o troca a cor da letra dos elementos selecionados. Funciona com todos os elementos que exibem letras: <strong>conceitos, legendas e rela&ccedil;&otilde;es bin&aacute;rias</strong>.
Selecione um ou mais desses elementos, v&aacute; na barra de menus,
clique em Formatar e, em seguida, em &ldquo;Cor da letra&rdquo;. </p>


<p align="center"><img src="imagens/023.jpg" height="272" width="268"></p>


<p>Selecione uma cor e clique em OK.</p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<p>&nbsp; </p>


<h3><a name="2"></a>Formatando fonte </h3>


<p>Essa opera&ccedil;&atilde;o troca as fontes, ou seja, os estilos e
tamanhos das letras dos elementos selecionados. Funciona com todos os
elementos que exibem letras: <strong>conceitos, legendas e rela&ccedil;&otilde;es bin&aacute;rias </strong>.
Selecione um desses elementos, v&aacute; na barra de menus, clique em
Formatar e, em seguida, em &ldquo;Fonte&rdquo;. Surgir&aacute; o
di&aacute;logo abaixo. </p>


<p align="center"><img src="imagens/027.jpg" height="314" width="337"></p>


<p>Aqui, voc&ecirc; pode selecionar o nome da fonte (como
&ldquo;Arial&rdquo; ou &ldquo;Times New Roman&rdquo;), o tamanho da
letra e o estilo (negrito, it&aacute;lico ou normal). Fa&ccedil;a as
altera&ccedil;&otilde;es e clique em OK. </p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<h3><a name="3"></a>Formatando cor de linha </h3>


<p>Essa opera&ccedil;&atilde;o troca a cor das linhas (arcos)
selecionadas. Ou seja, s&oacute; estar&aacute; funcionando quando
voc&ecirc; seleciona linhas (arcos). Selecione uma ou mais linhas,
v&aacute; na barra de menus, clique em Formatar e, em seguida, em
&ldquo;Cor da linha&rdquo;. Surgir&aacute; a tabela de cores abaixo. </p>


<p align="center"><img src="imagens/023.jpg" height="272" width="268"></p>


<p>Selecione uma cor e clique em OK. </p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<h3><a name="4"></a>Formatando estilo de linha </h3>


<p>Essa op&ccedil;&atilde;o troca o formato das linhas (arcos)
selecionadas. Ou seja, s&oacute; estar&aacute; funcionando quando
voc&ecirc; seleciona linhas (arcos). Selecione uma ou mais linhas,
v&aacute; na barra de menus, clique em Formatar e, em seguida, em
&ldquo;Estilo de linha&rdquo;. Surgir&aacute; o di&aacute;logo abaixo. </p>


<p align="center"><img src="imagens/026.jpg" height="216" width="268"></p>


<p>Existem 3 op&ccedil;&otilde;es: linha reta, linha ortogonal (v&aacute;rias retas) e linha curva. Selecione uma e clique em OK. </p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<h3><a name="5"></a>Formatando cor de borda </h3>


<p>Essa opera&ccedil;&atilde;o troca a cor das bordas dos elementos
selecionados. S&oacute; estar&aacute; funcionando quando voc&ecirc;
seleciona <strong>conceitos </strong>. Selecione um ou mais conceitos, v&aacute; na barra de menus, clique em Formatar e, em
seguida, em &ldquo;Cor da borda&rdquo;. Surgir&aacute; a tabela de
cores abaixo. </p>


<p align="center"><img src="imagens/023.jpg" height="272" width="268"></p>


<p>Selecione uma cor e clique em OK. </p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<p>&nbsp;</p>


<h3><a name="6"></a>Formatando cor de preenchimento </h3>


<p>Essa opera&ccedil;&atilde;o troca a cor de preenchimento dos
elementos selecionados. S&oacute; estar&aacute; funcionando quando
voc&ecirc; seleciona <strong>conceitos </strong>. Selecione
um ou mais conceitos, v&aacute; na barra de menus, clique em
Formatar e, em seguida, em &ldquo;Cor do preenchimento&rdquo;.
Surgir&aacute; a tabela de cores abaixo. </p>


<p align="center"><img src="imagens/023.jpg" height="272" width="268"></p>


<p>Selecione uma cor e clique em OK. </p>


</body>
</html>
